In [1]:
[3]*3 + ['a']*2

[3, 3, 3, 'a', 'a']

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
dframe = DataFrame({'key1':['A']*2+['B']*3,
                   'key2':[2,2,2,3,3]})

In [4]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [5]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [6]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [7]:
dframe.drop_duplicates('key1')

  key1  key2
0    A     2
2    B     2

In [8]:
dframe.drop_duplicates('key2')

  key1  key2
0    A     2
3    B     3

In [9]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [10]:
dframe.drop_duplicates(['key1','key2'])

  key1  key2
0    A     2
2    B     2
3    B     3

In [11]:
dfdf

NameError: name 'dfdf' is not defined

In [19]:
dframe.drop_duplicates(['key1'],take_last=True)

TypeError: drop_duplicates() got an unexpected keyword argument 'take_last'

In [20]:
# take_last is not working in jupyter notebook